================
Empty record
================
{}
----------------

(source_file
  (expression_declaration
    (record_expression)))

================
One-field record
================
{x=1}
----------------

(source_file
  (expression_declaration
    (record_expression
      (record_row
        (identifier_label
          (identifier))
        (integer_literal)))))

================
One-field selector record
================
{ 1 = 1 }
----------------

(source_file
  (expression_declaration
    (record_expression
      (record_row
        (int_label
          (index))
        (integer_literal)))))

================
Two-field record
================
{ x = 1, y = 2 }

---------

(source_file
  (expression_declaration
    (record_expression
      (record_row
        (identifier_label
          (identifier))
        (integer_literal))
      (record_row
        (identifier_label
          (identifier))
        (integer_literal)))))

================
ID vs Ident
================
{ * = 1 }

---------

(source_file
  (expression_declaration
    (record_expression
      (record_row
        (identifier_label
          (identifier))
        (integer_literal)))))
