================
Empty string
================
val _ = ""
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Single char
================
val _ = "A"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Space only
================
val _ = " "
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Printable min max
================
val _ = "!~"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Escape newline
================
val _ = "\n"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Escape tab
================
val _ = "\t"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Escape carriage return
================
val _ = "\r"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Multiple escapes
================
val _ = "Line1\nLine2\tTabbed"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Octal escape
================
val _ = "\007"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Hex escape
================
val _ = "\u0061"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Control character
================
val _ = "\^@"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Escaped quote
================
val _ = "\""
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Double backslash
================
val _ = "\\"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Repeated backslashes
================
val _ = "\\\\"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Unknown escape
:error
================
val _ = "\q"

------



================
Incomplete numeric escape
:error
================
val _ = "\0"

------



================
Backslash line continuation
================
val _ = "Hello \
    \World"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Multiline with blank
================
val _ = "Here is a line \
 
 \ with blank lines"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Multiline ending with quote
================
val _ = "Here is a line \
 \"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))

================
Unclosed string
:error
================
val _ = "This string never ends

------



================
Ends in backslash
:error
================
val _ = "Backslash at end \

------



================
Multiple numeric escapes
================
val _ = "\097\098\099"
----------------

(source_file
  (value_declaration
    (valbind
      (lhs
        (wildcard))
      (rhs
        (atomic_application_expression
          (string_literal))))))
