===================
Type Con
===================

val x : int = 3

-----

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (qualified_type_identifier
            (type_identifier
              (alphanum_identifier)))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Type Var
===================

val x : 'a = 3

-----

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (tyvar)))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Type Var 2
===================

val x : 'abc = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (tyvar)))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Type app
===================

val x : (a, 'b) t = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (tyapp
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier)))
            (tyvar)
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Type app 2
===================

val x : ('a t2) t = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (tyapp
            (tyapp
              (tyvar)
              (qualified_type_identifier
                (type_identifier
                  (alphanum_identifier))))
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Type app 3
===================

val x : 'a t = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (tyapp
            (tyvar)
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Type arrow
===================

val x : a -> b = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (arrow_type
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier)))
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Type arrow 2
===================

val x : a -> b -> c = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (arrow_type
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier)))
            (arrow_type
              (qualified_type_identifier
                (type_identifier
                  (alphanum_identifier)))
              (qualified_type_identifier
                (type_identifier
                  (alphanum_identifier)))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Type arrow 3
===================

val x : (a -> b) -> c = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (arrow_type
            (arrow_type
              (qualified_type_identifier
                (type_identifier
                  (alphanum_identifier)))
              (qualified_type_identifier
                (type_identifier
                  (alphanum_identifier))))
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Tuple type
===================

val x : (a * b) = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (tuple_type
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier)))
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Tuple type 2
===================

val x : a * b = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (tuple_type
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier)))
            (qualified_type_identifier
              (type_identifier
                (alphanum_identifier))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Record type
===================

val x : {x: int} = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (record_type
            (type_row
              (identifier_label
                (alphanum_identifier))
              (qualified_type_identifier
                (type_identifier
                  (alphanum_identifier)))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))

===================
Record type num
===================

val x : {1: int} = 3

------

(source_file
  (value_declaration
    (valbind
      (lhs
        (constraint_pattern
          (identifier_pattern
            (qualified_identifier
              (alphanum_identifier)))
          (record_type
            (type_row
              (int_label
                (index))
              (qualified_type_identifier
                (type_identifier
                  (alphanum_identifier)))))))
      (rhs
        (atomic_application_expression
          (integer_literal))))))
