===================
Type Con
===================

val x : int = 3

-----

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern) (tycon)))
      (rhs (integer_literal)))))

===================
Type Var
===================

val x : 'a = 3

-----

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern) (tyvar)))
      (rhs (integer_literal)))))

===================
Type Var 2
===================

val x : 'abc = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern) (tyvar)))
      (rhs (integer_literal)))))

===================
Type app
===================

val x : (a, 'b) t = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (tyapp (tycon) (tyvar) (tycon))
      ))
      (rhs (integer_literal)))))

===================
Type app 2
===================

val x : ('a t2) t = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (tyapp (tyapp (tyvar) (tycon)) (tycon))
      ))
      (rhs (integer_literal)))))

===================
Type app 3
===================

val x : 'a t = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (tyapp (tyvar) (tycon))
      ))
      (rhs (integer_literal)))))


===================
Type arrow
===================

val x : a -> b = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (arrow_type (tycon) (tycon))
      ))
      (rhs (integer_literal)))))

===================
Type arrow 2
===================

val x : a -> b -> c = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (arrow_type (tycon) (arrow_type (tycon) (tycon)))
      ))
      (rhs (integer_literal)))))

===================
Type arrow 3
===================

val x : (a -> b) -> c = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (arrow_type (arrow_type (tycon) (tycon)) (tycon))
      ))
      (rhs (integer_literal)))))

===================
Tuple type
===================

val x : (a * b) = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (tuple_type (tycon) (tycon))
      ))
      (rhs (integer_literal)))))

===================
Tuple type 2
===================

val x : a * b = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (tuple_type (tycon) (tycon))
      ))
      (rhs (integer_literal)))))

===================
Record type
===================

val x : {x: int} = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (record_type (type_row (identifier_label) (tycon)))
      ))
      (rhs (integer_literal)))))

===================
Record type num
===================

val x : {1: int} = 3

------

(source_file
  (structure_level_declaration
    (value_declaration
      (lhs (constraint_pattern (identifier_pattern)
           (record_type (type_row (int_label) (tycon)))
      ))
      (rhs (integer_literal)))))

